/*  Oop => Dart
Объектно-ориентированное программирование (ООП) - это метод
 программирования, использующий объекты и их взаимодействие
для разработки и программирования приложений. Это одна из 
самых популярных парадигм программирования, которая 
используется во многих языках программирования, таких
 как Dart, Java, C++, Python и др.

В ООП объектом может быть все, что угодно, например человек,
 банковский счет, автомобиль или дом. Каждый объект имеет
свои атрибуты (или свойства) и поведение (или методы).
 Например, объект person может иметь атрибуты name, age и
height, а также поведение walk и talk.

Features Of OOP
-Class
-Object
-Encapsulation
-Inheritance
-Polymorphism
-Abstraction
*/